#+title: coding patterns
** code blocks
#+begin_src shell :results output
  python3 src/zero_striping_inplace.py
  python3 src/verify_sudoku_board.py
  python3 src/hashmap_pair_sum.py
  python3 src/lexicographical_sequence.py
  python3 src/shift_zeros_to_end.py
  python3 src/largest_container.py
  python3 src/palindrome_checker.py
  python3 src/triplet_sum.py
  python3 src/pair_sum.py
  ls -lha
#+end_src

# use this to run a specific program alone 
#+begin_src shell :results output
  python3 src/zero_striping_inplace.py
#+end_src

#+RESULTS:
#+begin_example
,#+TITLE: Matrix Zero Striping Test Results
,#+CAPTION: Complexity: Time O(MN), Space O(1)
| Test Case Name | Input Matrix | Expected | Result | Status |
|----------------+--------------+----------+--------+--------|
| Standard 3x3 | [[1,1,1],[1,0,1],[1,1,1]] | [[1,0,1],[0,0,0],[1,0,1]] | [[1,0,1],[0,0,0],[1,0,1]] | PASS |
| Multiple Zeroes | [[0,1,2,0],[3,4,5,2],[1,3,1,5]] | [[0,0,0,0],[0,4,5,0],[0,3,1,0]] | [[0,0,0,0],[0,4,5,0],[0,3,1,0]] | PASS |
| First Row/Col Zero | [[0,1],[1,1]] | [[0,0],[0,1]] | [[0,0],[0,1]] | PASS |
| No Zeroes | [[1,2],[3,4]] | [[1,2],[3,4]] | [[1,2],[3,4]] | PASS |
| Single Element Zero | [[0]] | [[0]] | [[0]] | PASS |
| All Zeroes | [[0,0],[0,0]] | [[0,0],[0,0]] | [[0,0],[0,0]] | PASS |

# Note: Results generated using in-place mutation algorithm.
#+end_example

